Cyve-var/STM32G431-Vin/digithingSTM32G431Blinky-master/SW/EmbSrc/Src/Drv/G431Gpio.c
#include "../Target/Target.h"
#include "../STM32G431/STM32G431_GPIOB_Def.h"
#include "../STM32G431/STM32G431_GPIOA_Def.h"


#define GPIO_INPUT_MODE_0 0
#define GPIO_OUTPUT_MODE_1 1
#define GPIO_ALTERNATE_FUNCTION_MODE_2 2
#define GPIO_ANALOG_MODE_3 3

void GpioInitPortB(void) {
	volatile sSTM32G431_GPIOB* pSTM32G431_GPIOB = (sSTM32G431_GPIOB*)GPIOB_ADR;
	uSTM32G431_GPIOB_MODER STM32G431_GPIOB_MODER;
	uSTM32G431_GPIOB_AFRH STM32G431_GPIOB_AFRH;
	uSTM32G431_GPIOB_AFRL STM32G431_GPIOB_AFRL;
	uSTM32G431_GPIOB_PUPDR STM32G431_GPIOB_PUPDR;

	// Alternate Functions

	STM32G431_GPIOB_AFRH.All = pSTM32G431_GPIOB->STM32G431_GPIOB_AFRH.All;
	pSTM32G431_GPIOB->STM32G431_GPIOB_AFRH.All = STM32G431_GPIOB_AFRH.All;

	// Alternate Functions Low:
	STM32G431_GPIOB_AFRL.All = pSTM32G431_GPIOB->STM32G431_GPIOB_AFRL.All;
	pSTM32G431_GPIOB->STM32G431_GPIOB_AFRL.All = STM32G431_GPIOB_AFRL.All;


	// Moder:
	STM32G431_GPIOB_MODER.All = pSTM32G431_GPIOB->STM32G431_GPIOB_MODER.All;

	// Switches from switchled.c
	STM32G431_GPIOB_MODER.Bit.MODER0 = GPIO_INPUT_MODE_0; // Switch 1
	STM32G431_GPIOB_MODER.Bit.MODER7 = GPIO_INPUT_MODE_0; // Switch 2
	STM32G431_GPIOB_MODER.Bit.MODER5 = GPIO_INPUT_MODE_0; // Switch 3


	pSTM32G431_GPIOB->STM32G431_GPIOB_MODER.All = STM32G431_GPIOB_MODER.All;


	// Pull Up PUll Down Register:
	STM32G431_GPIOB_PUPDR.All = pSTM32G431_GPIOB->STM32G431_GPIOB_PUPDR.All;

	// 1 = pull-up, 2 = pull-down

	// Switches from switchled.c
	STM32G431_GPIOB_PUPDR.Bit.PUPDR0 = 1;
	STM32G431_GPIOB_PUPDR.Bit.PUPDR7 = 1;
	STM32G431_GPIOB_PUPDR.Bit.PUPDR5 = 1;


	pSTM32G431_GPIOB->STM32G431_GPIOB_PUPDR.All = STM32G431_GPIOB_PUPDR.All;
}

void GpioInitPortA(void) {
	volatile sSTM32G431_GPIOA* pSTM32G431_GPIOA = (sSTM32G431_GPIOA*)GPIOA_ADR;
	uSTM32G431_GPIOA_MODER STM32G431_GPIOA_MODER;
	uSTM32G431_GPIOA_AFRH STM32G431_GPIOA_AFRH;
	uSTM32G431_GPIOA_PUPDR STM32G431_GPIOA_PUPDR;

	STM32G431_GPIOA_AFRH.All = pSTM32G431_GPIOA->STM32G431_GPIOA_AFRH.All;
	pSTM32G431_GPIOA->STM32G431_GPIOA_AFRH.All = STM32G431_GPIOA_AFRH.All;

	// MODER
	STM32G431_GPIOA_MODER.All = pSTM32G431_GPIOA->STM32G431_GPIOA_MODER.All;
	// LEDs from the switchled.c
	STM32G431_GPIOA_MODER.Bit.MODER9 = GPIO_OUTPUT_MODE_1; // LED 1
	STM32G431_GPIOA_MODER.Bit.MODER10 = GPIO_OUTPUT_MODE_1; // LED 2
	STM32G431_GPIOA_MODER.Bit.MODER12 = GPIO_OUTPUT_MODE_1; // LED 3
	STM32G431_GPIOA_MODER.Bit.MODER11 = GPIO_OUTPUT_MODE_1; // LED 4

	// Switch 4
	STM32G431_GPIOA_MODER.Bit.MODER2 = GPIO_INPUT_MODE_0; // Switch 4

	pSTM32G431_GPIOA->STM32G431_GPIOA_MODER.All = STM32G431_GPIOA_MODER.All;

	// Pull Up PUll Down Register:
	STM32G431_GPIOA_PUPDR.All = pSTM32G431_GPIOA->STM32G431_GPIOA_PUPDR.All;
	// 1 = pull-up, 2 = pull-down
	// Switches from switchled.c
	STM32G431_GPIOA_PUPDR.Bit.PUPDR2 = 1;

	pSTM32G431_GPIOA->STM32G431_GPIOA_PUPDR.All = STM32G431_GPIOA_PUPDR.All;

}

void GpioInit(void) {
	GpioInitPortB();
	GpioInitPortA();
}
